{
    "brandText":"Βασίλης Σμύρης",
    "welcome":"Καλώς ορίσατε στην ιστοσελίδα μου!",
    "heroText":"Ονομάζομαι Βασίλης Σμύρης. Είμαι full-stack developer από την Ελλάδα, με πάθος για το αποδοτικό, scalable και φιλικό προς τον χρήστη λογισμικό.",
    "requestCV":"Ζητήστε CV",
    "contactMe": "Επικοινωνήστε",
    "aboutMe":"Σχετικά",
    "education": "Διαπιστευτήρια",
    "workExperience": "Εμπειρία",
    "projects":"Projects",
    "summary":"Σύνοψη",
    "skills":"Δεξιότητες",
    "aboutSummaryText":"&nbsp;&nbsp;&nbsp;&nbsp;Γεια, με λένε Βασίλη Σμύρη και είμαι ένας full-stack software developer από την Αθήνα. Είμαι κάτοχος BSc στην Επιστήμη Πληροφορικής από το Πανεπιστήμιο Πειραιώς και πρόσφατα έχω ξεκινήσει την καριέρα μου ως software developer. Εργάζομαι ως IT Implementation Consultant στην NCR Atleos, αναπτύσσοντας λογισμικό για συσκευές και δίκτυα ATM και παρέχοντας τεχνική υποστήριξη για λύσεις ATM σε καθημερινή βάση. Επίσης, παρακολουθώ ένα Μεταπτυχιακό Πρόγραμμα στην Ανάπτυξη Λογισμικού στο Πανεπιστήμιο Πειραιώς.<br/>&nbsp;&nbsp;&nbsp;&nbsp;Μέσω των σπουδών μου, της δουλειάς μου και προσωπικών project, έχω αποκτήσει εκτενή εμπειρία σε διάφορες γλώσσες προγραμματισμού, frameworks ανάπτυξης λογισμικού και άλλες τεχνολογίες. Διακατέχομαι από μια καίρια θεωρητική αντίληψη των αρχών του προγραμματισμού και μια βαθιά εκτίμηση για τη σχεδίαση αποδοτικού, scalable και φιλικού προς το χρήστη λογισμικού και τη σύνταξη καθαρού, επαναχρησιμοποιήσιμου και εύκολου στη συντήρηση κώδικα. Οι δεξιότητές μου περιλαμβάνουν σχεδίαση και ανάπτυξη σε front και back end, καθώς και μια καλή κατανόηση της υποδομής, σε λογισμικό και υλισμικό, που απαιτείται για το deployment σύνθετων εφαρμογών. Ειδικεύομαι στην ανάπτυξη full-stack web εφαρμογών, χρησιμοποιώντας Angular για το front-end και Spring για το back-end, και στην ενσωμάτωση των εφαρμογών αυτών με εξωτερικά συστήματα. Ακόμα, έχω καλή εμπειρία με το .NET Framework και τις διάφορες βιβλιοθήκες του για ανάπτυξη web και desktop εφαρμογών, και με την Python, την οποία έχω χρησιμοποιήσει για διάφορα επιστημονικά project στο πανεπιστήμιο και για να αναπτύξω web apps με το Django framework.<br/>&nbsp;&nbsp;&nbsp;&nbsp;Η καλύτερη σύνοψη της γνώσης και των δεξιοτήτων που μάζεψα ανά τα χρόνια είναι η πτυχιακή μου εργασία, αντικείμενο της οποίας είναι οι εφαρμογές smart home. Η εφαρμογή που αναπτύχθηκε για το project, αποτελείται από έναν web server ο οποίος λειτουργεί ως το smart-home hub και σερβίρει τους χρήστες με ένα UI μέσω web browser που κάνει δυνατή την επικοινωνία αυτών με τις διάφορες έξυπνες συσκευές στο δίκτυο, ανεπτυγμένη με Blazor Webassembly, και μια πρωτότυπη συσκευή έξυπνης λάμπας RGB, φτιαγμένη με τη χρήση υπολογιστή Raspberry Pi, Python και βασικών γνώσεων ηλεκτρονικής. Το highlight του project είναι η δημιουργία ενός πρωτοκόλλου επικοινωνίας μεταξύ των συσκευών και του server, το οποίο υποστηρίζει τη διαχείριση και τον έλεγχο των συσκευών και τη δημιουργία σελίδων UI για τους σκοπούς αυτούς, ανεξαρτήτου του τύπου συσκευής.<br/>&nbsp;&nbsp;&nbsp;&nbsp; Όταν δε δουλεύω, μου αρέσει να διαβάζω ιστορία και γεωγραφία, να γυμνάζομαι, να μαθαίνω ξένες γλώσσες, να συλλέγω και να ταξιδεύω. Έχω πάντα τη διάθεση να συνεργαστώ σε νέα project, επομένως μη διστάσετε να <a href=\"#contact\">επικοινωνήσετε μαζί μου</a>.",
    "aboutSkillsText":"<h2>Γλώσσες Προγραμματισμού</h2>Python, JavaScript, Java, C#, C++<h2>Front End</h2>HTML5, CSS3, Bootstrap 4, Angular, PrimeNG<h2>Web Frameworks</h2>Django, ASP.NET, Blazor WebAssembly, Spring Boot<h2>Desktop Frameworks</h2>Windows Forms, WPF<h2>Λειτουργικά Συστύματα</h2>Windows, Debian Linux και παράγωγα<h2>Συστύματα βάσεων δεδομένων</h2>PostgreSQL, MySQL, MSSQL, MongoDB<h2>Λογισμικό Editing</h2>Photoshop, Sony Vegas<h2>Version Control</h2>Git",
    "readMore":"Περισσότερα",
    "close":"Κλείσιμο",
    "top":"Κορυφή",
    "eduList":[
        {
            "orgLink":"https://www.unipi.gr/",
            "logo":"unipi.png",
            "logoAlt":"UNIPI LOGO",
            "html":"<h2>Πανεπιστήμιο Πειραιώς</h2><h4>Τμήμα Πληροφορικής</h4>MSc σε \"Προηγμένα Συστήματα Πληροφορικής - Ανάπτυξη Λογισμικού και Τεχνητής Νοημοσύνης\""
        },
        {
            "orgLink":"https://www.unipi.gr/",
            "logo":"unipi.png",
            "logoAlt":"UNIPI LOGO",
            "html":"<h2>Πανεπιστήμιο Πειραιώς</h2><h4>Τμήμα Πληροφορικής</h4><h5>BSc στην Επιστήμη Υπολογιστών</h5>Βαθμός: 8.20/10"
        },
        {
            "orgLink":"https://www.linkedin.com/in/vasilis-smyris-1010401ab/details/certifications/",
            "logo":"linkedin.png",
            "logoAlt":"LinkedIn In Logo",
            "html":"<h2>LinkedIn&trade; Learning</h2> Ολοκλήρωση 27 courses σχετικά με full-stack development, δίκτυα, βάσεις δεδομένων, βέλτιστες πρακτικές κ.α.<br/><span>Δείτε τη λίστα πιστοποιήσεων <a href=\"https://www.linkedin.com/in/vasilis-smyris-1010401ab/details/certifications/\" target=\"_blank\">εδώ</a>.</span>"
        },
        {
            "orgLink":"https://gfoss.eu/",
            "logo":"gfoss.png",
            "logoAlt":"GFOSS Logo",
            "html":"<h2>GFOSS</h2><h4>Web Design and Web Development</h4><h5>Certificate ID: 6gB3WdXXYB</h5><span>Τρίμηνο course που κάλυψε τεχνολογίες web όπως HTML5, CSS3, JavaScript, Bootstrap4 and node.js.<br/>Δείτε την πιστοποίηση <a href=\"https://drive.google.com/file/d/1x6yNvosspBj2OX3osrFLutHvmVSoIIwJ/view?usp=share_link\" target=\"_blank\">εδώ</a>.</span>"
        }
    ],
    "workList": [
        {
            "organization":"NCR Corporation",
            "yr":"Ιανουάριος 2023 - Σήμερα",
            "position":"IT Implementation Consultant",
            "tasks":[
                "Παροχή τεχνικής υποστήριξης για λύσεις ATM σε καθημερινή βάση.",
                "Ανάπτυξη αλλαγών/αναβαθμίσεων για συσκευές και δίκτυα ATM.",
                "Σχεδίαση και ανάπτυξη web portals για τη διαχείριση δικτύων ATM.",
                "Ανάπτυξη λογισμικού βάσει αιτημάτων και απαιτήσεων πελάτη.",
                "Συμμετοχή στο intergration των προϊόντων του προμηθευτή με τα συστήματα του πελάτη.",
                "Διευκόλυνση της επικοινωνίας μεταξύ πελάτη και προμηθευτή.",
                "Παροχή ποιοτικού customer service και σημαντική συμβολή στην ικανοποίηση του πελάτης προς τα προϊόντα και τις υπηρεσίες της εταιρείας."
            ]
        },
        {
            "organization":"Volton",
            "yr":"Ιούλιος 2020 - Δεκέμβριος 2022",
            "position":"Contract Management Administrator",
            "tasks":[
                "Καταχώρηση και έλεγχος δεδομένων για συμβόλαια ηλεκτρικής ενέργειας."
            ]
        },
        {
            "organization":"Πανεπιστήμιο Πειραιώς",
            "yr":"Οκτώβριος 2018 - Οκτώβριος 2020",
            "position":"System Administrator στα εργαστήρια υπολογιστών του Τμήματος Πληροφορικής",
            "tasks":[
                "Εκτέλεση καθημερινών εργασιών διαχείρισης.",
                "Σχεδίαση και υλοποίηση του front-end της ιστοσελίδας των εργαστηρίων του Τμήματος Πληροφορικής(<a href=\"https://cslab.unipi.gr/\">cslab.unipi.gr</a>).",
                "Συντήρηση της ιστοσελίδα; των εργαστηρίων του Τμήματος Πληροφορικής.",
                "Ανάπτυξη του back-end της πλατφόρμας διαχείρισης αιθουσών των εργαστηρίων του Τμήματος Πληροφορικής.",
                "Ανάπτυξη του front-end της πλατφόρμας διαχείρισης αιθουσών των εργαστηρίων του Τμήματος Πληροφορικής.",
                "Δημιουργία αφισών και ψηφιακού προωθητικού υλικού για event."
            ]
        }
    ],
    "projectsList":[
        {
            "id":"smart-home-thesis",
            "title": "Πτυχιακή Eργασία Smart Home",
            "summary": "Η πτυχιακή μου εργασία. Το θέμα είναι τα συστήματα έξυπνου σπιτιού. Το σύστημα της εργασίας αποτελείται από μία web εφαρμογή smart home hub και μια πρωτότυπη έξυπνη συσκευή λάμπας RGB.",
            "get": "<b>Github:</b> <a href=\"https://github.com/BillSmiris/University-Thesis-Smart-Home\" target=\"_blank\">https://github.com/BillSmiris/University-Thesis-Smart-Home</a>",
            "technologies": "Blazor Webassembly, C#, Python, Raspberry Pi, HTML5, CSS3, JS, PostgreSQL",
            "points": [
                "Σύστημα smart home που αναπτύχθηκε για την πτυχιακή μου εργασία.",
                "Το σύστημα αποτελείται από μία web εφαρμογή, που λειτουργεί ως το smart home hub, και μια πρωτότυπη συσκευή λάμπας RGB.",
                "Το σύστημα είναι σχεδιασμένο για να λειτουργεί σε τοπικό δίκτυο και να χρησιμοποιείται μέσω του web browser οποιασδήποτε συσκευής για τον έλεγχο ενός οικοσυστήματος έξυπνων συσκευών.",
                "Η πρωτότυπη έξυπνη συσκευή αποτελείται από έναν υπολογιστή Raspberry Pi, ο οποίος τρέχει ένα script Python που καθορίζει τη συμπεριφορά της συσκευής, και ένα βασικό κύκλωμα λάμπας RGB συνδεδεμένο σε αυτόν.",
                "Το script της έξυπνης συσκευής έχει σχεδιαστεί έτσι ώστε να αποτελεί blueprint για τη δημιουργία script για άλλους τύπους συσκευών.",
                "Το smart home hub έχει σχεδιαστεί έτσι ώστε να επιτρέπει των έλεγχου μεταβλητού αριθμού συσκευών.",
                "Το smart home hub προβάλλει controls για τη συσκευή με βάση τις διαθέσιμες ρυθμίσεις της συσκευής και τους τύπους ρυθμίσεων που υποστηρίζει το σύστημα.",
                "Η επικοινωνία μεταξύ των συσκευών και του smart home hub πραγματοποιείται μέσω της χρήσης του πρωτοκόλλου WebSockets.",
                "Συμπεριλαμβάνονται features, όπως λογαριασμοί χρηστών και εναλλαγή μεταξύ φωτεινού και σκούρου θέματος."
            ]
        },
        {
            "id":"parking",
            "title": "ParKing",
            "summary": "Εφαρμογή Android για parking. Η εφαρμογή δίνει στους χρήστες τη δυνατότητα να βρίσκουν εύκολα εγκαταστάσεις parking που βρίσκονται κοντά τους και σχετικές πληροφορίες για αυτές, επιτρέποντάς τους να συγκρίνουν ταχύτατα τις διαθέσιμες επιλογές και να βρίσκουν αυτή που ταιριάζει καλύτερα στις ανάγκες τους.",
            "get": "<b>Github:</b> <a href=\"https://github.com/BillSmiris/ParKing\" target=\"_blank\">https://github.com/BillSmiris/ParKing</a>",
            "technologies": "Android Studio, Java, Google Firebase",
            "points": [
                "Εφαρμογή Android για parking, ανεπτυγμένη για πανεπιστημιακή εργασία.",
                "Οι χρήστες μπορούν να βλέπουν εγκαταστάσεις parking γύρω τους σε χάρτη ή σε μορφή λίστας.",
                "Οι χρήστες μπορούν εύκολα και γρήγορα να βλέπουν και να συγκρίνουν τις τιμές, τις υπηρεσίες και τη διαθεσιμότητα των εγκαταστάσεων.",
                "Η εφαρμογή χρησιμοποιεί Google services και αισθητήρες του κινητού, όπως Google Maps, Google Firebase και GPS."
            ]
        },
        {
            "id":"sandbox",
            "title": "Unity Scripting Demo",
            "summary": "Ένα μικρό demo φτιαγμένο με σκοπό την εξοικείωση με το scripting στο Unity. Στο demo, οι παίκτες μπορούν να χειριστούν έναν χαρακτήρα από πρώτο-πρόσωπο και να αλληλεπιδράσουν με διάφορα αντικείμενα στο περιβάλλον.",
            "get": "Το demo είναι διαθέσιμο <a href=\"https://drive.google.com/file/d/1_4Cv_sLoWSC2ogZUZnQPO2hfmqGqB20G/view?usp=share_link\" target=\"_blank\">εδώ</a>",
            "technologies": "Unity, C#",
            "points": [
                "Μικρό project φτιαγμένο με σκοπό την εξοικίωση με το scripting στο  Unity game engine.",
                "Το demo αποτελείται από ένα περιβάλλον με έναν παίκτη πρώτου προσώπου και διάφορες αλληλεπιδράσεις.",
                "Ο παίκτης πρώτου προσώπου έχει διάφορες τυπικές λειτουργίες, όπως το να κινείται στο χώρο και να κοιτά γύρω του, να τρέχει, να αλλάζει στάση(όρθιος, σκυμμένος, πρηνηδόν) και να αλληλεπιδρά με διάφορα αντικείμενα στο περιβάλλον.",
                "Οι αλληλεπιδράσεις πραγματοποιούνται μέσω ενός γενικευμένου framework αλληλεπίδρασης, που αποτελείται από την προβολή μια προτροπής στον παίκτη για μια αλληλεπίδραση και την ικανότητα να ενεργοποιήσει την αλληλεπίδραση.",
                "Το γενικευμένο framework αλληλεπίδρασης μπορεί να επεκταθεί, για να υποστηρίξει τις ιδιαίτερες ανάγκες της κάθε αλληλεπίδρασης.",
                "Οι αλληλεπιδράσεις που έχουν υλοποιηθεί περιλαμβάνουν τηλεμεταφορείς, πόρτες και ανελκυστήρες.",
                "Τα script των αλληλεπιδράσεων μπορούν να δεχθούν διάφορες παραμέτρους που επηρεάζουν τη συμπεριφορά της αλληλεπίδρασης."
            ]
        },
        {
            "id":"edu1821",
            "title": "Εκπαιδευτική Εφαρμογή",
            "summary": "Εκπαιδευτική εφαρμογή, ανεπτυγμένη για πανεπιστημιακή εργασία. Μέσω της εφαρμογής, οι χρήστες μπορούν να μάθουν για τα πρόσωπα της Ελληνικής Επανάστασης και να αξιολογήσουν τη γνώση τους μέσω τεστ. Η εφαρμογή είναι διαθέσιμη σε εκδόσεις desktop και web.",
            "get": "<b>Github:</b> <a href=\"https://github.com/BillSmiris/Educational-Application\" target=\"_blank\">https://github.com/BillSmiris/Educational-Application</a></br><a href=\"https://drive.google.com/file/d/1WX2GmOwCyjYZDb25NqytJ74Ja-o7oZIi/view?usp=drive_link\" target=\"_blank\" class=\"fw-bold\">Web app demo video</a></br><a href=\"https://drive.google.com/file/d/1mBzGLmV3gFxuqUUw01D4lj2VlFS2Q5QY/view?usp=drive_link\" target=\"_blank\" class=\"fw-bold\">Desktop app demo video</a>",
            "technologies": "WPF, ASP.NET, C#, HTML5, CSS3, JS, PostgreSQL",
            "points": [
                "Εκπαιδευτική εφαρμογή, ανεπτυγμένη για πανεπιστημιακή εργασία.",
                "Μέσω της εφαρμογής, οι χρήστες μπορούν να μάθουν για τα πρόσωπα της Ελληνικής Επανάστασης.",
                "Η εφαρμογή περιλαμβάνει ασκήσης πολλαπλής επιλογής, μέσω των οποίων οι χρήστες μπορούν να αξιολογήσουν τις γνώσεις τους.",
                "Η εφαρμογή είναι διαθέσιμη σε εκδόσεις desktop και web.",
                "Η εφαρμογή έχει σχεδιαστεί με τρόπο ώστε το περιεχόμενο της να μπορεί να επεκταθεί εύκολα και να προσαρμοστεί σε άλλα θέματα."
            ]
        },
        {
            "id":"cslab",
            "title": "CSLab Website",
            "summary": "Ενημερωτική ιστοσελίδα για τα εργαστήρια υπολογιστών του Τμήματος Πληροφορικής του Πανεπιστημίου Πειραιώς. Μέσω της ιστοσελίδας, οι φοιτητές μπορούν να ενημερώνονται για τη λειτουργία των εργαστηρίων και να αποκτούν πρόσβαση στις ψηφιακές υπηρεσίες του πανεπιστημίου.",
            "get": "<b>URL:</b> <a href=\"https://cslab.unipi.gr\" target=\"_blank\">https://cslab.unipi.gr</a>",
            "technologies": "HTML5, CSS3, JS, Bootstrap4, Python, Django",
            "points": [
                "Ιστοσελίδα για τα εργαστήρια υπολογιστών του Τμήματος Πληροφορικής του Πανεπιστημίου Πειραιώς.",
                "Η ιστοσελίδα χρησιμοπείται ως κέντρο ενημέρωσης για τους φοιτητές του Τμήματος Πληροφορικής, μέσω του οποίου μπορούν να πληροφορούνται για τις ψηφιακές υπηρεσίες που παρέχει το Πανεπιστήμιο, της υπηρεσίες των εργαστηρίων του, τα μαθήματα του τμήματος και να ενημερώνονται για τη λειτουργία των εργαστηρίων.",
                "Σχεδίασα το front-end της κύριας σελίδας και του wiki με τη χρήση Photoshop.",
                "Υλοποίησα το front-end χρησιμοποιόντας HTML, CSS, JS και Bootstrap4.",
                "Εκτέλεσα διάφορες εργασίες ενημέρωσης και συντήρησης μετά το deployment."
            ]
        }
    ],
    "technologiesUsed":"Τεχνολογίες",
    "projectPoints":"Σημεία του project"
 }