{
    "brandText":"Vasilis Smyris",
    "welcome":"Welcome to my website!",
    "heroText":"My name is Vasilis Smyris. I am a full-stack software developer from Greece, with a passion for efficient, scalable and user-friendly software.",
    "requestCV":"Request CV",
    "contactMe": "Get in touch",
    "aboutMe":"About Me",
    "education": "Education",
    "workExperience": "Professional Experience",
    "projects":"Projects",
    "summary":"Summary",
    "skills":"Skills",
    "aboutSummaryText":"&nbsp;&nbsp;&nbsp;&nbsp;Hello, I am Vasilis Smyris, a full-stack software developer based in Athens, Greece. I hold a BSc in Computer Science from the University of Piraeus and have recently started my career in software development. Over the years, I have gained extensive experience in various programming languages, software development frameworks, and other technologies, both through my academic studies and personal projects. I possess a solid theoretical understanding of the principles of programming and a deep appreciation for the design of efficient, scalable and user-friendly software and the authoring of clean, reusable and maintainable code. My skillset includes front-end and back-end development, as well as a good understanding of the infrastructure, in software and hardware, required to deploy complex applications. I specialise in the .NET Framework and the C# programming language, with a portfolio of desktop and web applications built using the plethora of the framework's project types. In addition, I have extensive experience with Python, which I use primarily for prototyping and exploring complex scientific topics. Recently, I have been expanding my horizons by delving into low-level problem-solving with C++, game development, and electronics.&nbsp;&nbsp;&nbsp;&nbsp;The most definitive culmination of the knowledge and skills I have gathered over the years has been my university dissertation, which touches upon smart home applications. The application developed for this project consists of a web server that works as the smart-home hub, which serves the users with a UI through a web browser and facilitates the communication between them and the various smart devices in the network, developed using Blazor Webassembly, and a prototype smart RGB lamp device, built using a Raspberry Pi computer, Python, and basic electronics knowledge. The highlight of the project is the creation of a protocol of communication between the devices and the server, which can facilitate the administration and control of the devices and the creation of UI pages for these purposes, independent of the device type.&nbsp;&nbsp;&nbsp;&nbsp;I currently work as an IT Implementation Consultant at NCR Corporation, providing technical support for ATM solutions on a day-to-day basis. When I'm not working, I enjoy studying history and geography, editing photos and videos, working out, learning new languages, collecting and travelling. I'm always eager to collaborate on new projects, so please don't hesitate to <a href=\"#contact\">get in touch</a>.",
    "aboutSkillsText":"<h2>Programming Languages</h2>Python, JavaScript, C#, C++<h2>Front End</h2>HTML5, CSS3, Bootstrap 4<h2>Web Frameworks</h2>Django, ASP.NET, Blazor WebAssembly<h2>Desktop Frameworks</h2>Windows Forms, WPF<h2>Operating Systems</h2>Windows, Debian Linux and derivatives<h2>Database Systems</h2>PostgreSQL, MySQL, MongoDB<h2>Editing Software</h2>Photoshop, Sony Vegas<h2>Version Control</h2>Git",
    "readMore":"Read More",
    "close":"Close",
    "top":"Top"
 }