{
    "brandText":"Vasilis Smyris",
    "welcome":"Welcome to my website!",
    "heroText":"My name is Vasilis Smyris. I am a full-stack software developer from Greece, with a passion for efficient, scalable and user-friendly software.",
    "requestCV":"Request CV",
    "contactMe": "Get in touch",
    "aboutMe":"About Me",
    "education": "Education & Certifications",
    "workExperience": "Professional Experience",
    "projects":"Projects",
    "summary":"Summary",
    "skills":"Skills",
    "aboutSummaryText":"&nbsp;&nbsp;&nbsp;&nbsp;Hello, I am Vasilis Smyris, a full-stack software developer based in Athens, Greece. I hold a BSc in Computer Science from the University of Piraeus and have recently started my career in software development. Over the years, I have gained extensive experience in various programming languages, software development frameworks, and other technologies, both through my academic studies and personal projects. I possess a solid theoretical understanding of the principles of programming and a deep appreciation for the design of efficient, scalable and user-friendly software and the authoring of clean, reusable and maintainable code. My skillset includes front-end and back-end development, as well as a good understanding of the infrastructure, in software and hardware, required to deploy complex applications. I specialise in the .NET Framework and the C# programming language, with a portfolio of desktop and web applications built using the plethora of the framework's project types. In addition, I have extensive experience with Python, which I use primarily for prototyping and exploring complex scientific topics. Recently, I have been expanding my horizons by delving into low-level problem-solving with C++, game development, and electronics.&nbsp;&nbsp;&nbsp;&nbsp;The most definitive culmination of the knowledge and skills I have gathered over the years has been my university dissertation, which touches upon smart home applications. The application developed for this project consists of a web server that works as the smart-home hub, which serves the users with a UI through a web browser and facilitates the communication between them and the various smart devices in the network, developed using Blazor Webassembly, and a prototype smart RGB lamp device, built using a Raspberry Pi computer, Python, and basic electronics knowledge. The highlight of the project is the creation of a protocol of communication between the devices and the server, which can facilitate the administration and control of the devices and the creation of UI pages for these purposes, independent of the device type.&nbsp;&nbsp;&nbsp;&nbsp;I currently work as an IT Implementation Consultant at NCR Corporation, providing technical support for ATM solutions on a day-to-day basis. When I'm not working, I enjoy studying history and geography, editing photos and videos, working out, learning new languages, collecting and travelling. I'm always eager to collaborate on new projects, so please don't hesitate to <a href=\"#contact\">get in touch</a>.",
    "aboutSkillsText":"<h2>Programming Languages</h2>Python, JavaScript, C#, C++<h2>Front End</h2>HTML5, CSS3, Bootstrap 4<h2>Web Frameworks</h2>Django, ASP.NET, Blazor WebAssembly<h2>Desktop Frameworks</h2>Windows Forms, WPF<h2>Operating Systems</h2>Windows, Debian Linux and derivatives<h2>Database Systems</h2>PostgreSQL, MySQL, MongoDB<h2>Editing Software</h2>Photoshop, Sony Vegas<h2>Version Control</h2>Git",
    "readMore":"Read more",
    "close":"Close",
    "top":"Top",
    "eduList":[
        {
            "orgLink":"https://www.unipi.gr/unipi/en/home-cs.html",
            "logo":"unipi.jpg",
            "logoAlt":"UNIPI LOGO",
            "html":"<h2>University of Piraeus</h2><h4>Department of Informatics</h4><h5>BSc in Computer Science</h5>Grade: 8.20/10"
        },
        {
            "orgLink":"https://www.linkedin.com/in/vasilis-smiris-1010401ab/details/certifications/",
            "logo":"linkedin.png",
            "logoAlt":"LinkedIn In Logo",
            "html":"<h2>LinkedIn&trade; Learning</h2>Completed 14 courses, covering HTML5, CSS3, JavaScript, AngularJS, C# and best practices.<br/><span>View certificate list <a href=\"https://www.linkedin.com/in/vasilis-smiris-1010401ab/details/certifications/\" target=\"_blank\">here</a>.</span>"
        },
        {
            "orgLink":"https://gfoss.eu/",
            "logo":"gfoss.png",
            "logoAlt":"GFOSS Logo",
            "html":"<h2>GFOSS</h2><h4>Web Design and Web Development</h4><h5>Certificate ID: 6gB3WdXXYB</h5><span>Three-month course that covered web technologies like HTML5, CSS3, JavaScript, Bootstrap4 and node.js.<br/>View certificate <a href=\"https://drive.google.com/file/d/1x6yNvosspBj2OX3osrFLutHvmVSoIIwJ/view?usp=share_link\" target=\"_blank\">here</a>.</span>"
        }
    ],
    "workList": [
        {
            "organization":"University of Piraeus",
            "yr":"October 2018 - October 2020",
            "position":"System Administrator in the Computer Science Department’s Laboratories",
            "tasks":[
                "Carried out routine administrative tasks.",
                "Designed and implemented the front end of the Computer Science Department’s Laboratories’ website(<a href=\"https://cslab.unipi.gr/\">cslab.unipi.gr</a>).",
                "Maintained the Computer Science Department’s Laboratories’ website.",
                "Worked on the back end of the Computer Science Department’s Laboratories’ classroom management platform.",
                "Worked on the front end of the Computer Science Department’s Laboratories’ classroom management platform.",
                "Created posters and digital promotional material for events."
            ]
        },
        {
            "organization":"Volton",
            "yr":"July 2020 - December 2022",
            "position":"Contract Management Administrator",
            "tasks":[
                "Data entry and vetting for electricity contracts."
            ]
        },
        {
            "organization":"NCR Corporation",
            "yr":"January 2023 - Present",
            "position":"IT Implementation Consultant",
            "tasks":[
                "Provided technical support for ATM solutions on a day-to-day basis."
            ]
        }
    ],
    "projectsList":[
        {
            "id":"smart-home-thesis",
            "title": "Smart Home University Dissertation",
            "summary": "This is my university dissertation. The topic is smart home systems. The project's system consists of a smart home hub web application and a prototype RGB light smart device.",
            "get": "<b>Github:</b> <a href=\"https://github.com/BillSmiris/University-Thesis-Smart-Home\">https://github.com/BillSmiris/University-Thesis-Smart-Home</a>",
            "technologies": "Blazor Webassembly, C#, Python, Raspberry Pi, HTML5, CSS3, JS, PostgreSQL",
            "points": [
                "Smart home application developed for my university dissertation.",
                "The application comprises of a Blazor WebAssembly web application which functions as the smart home hub, and a prototype smart RGB light device.",
                "The application is intended to be deployed on a local network and accessed via any device's web browser to manage a smart device ecosystem.",
                "The prototype smart device comprises of a Raspberry Pi computer that runs a Python script containing the device's behaviour and a basic RGB lamp circuit connected to it.",
                "The smart device script acts as a blueprint for creating scripts for other types of devices.",
                "The smart home hub is designed to manage a variable number of devices.",
                "The smart home hub displays controls for the device based on its properties and supported property types.",
                "The WebSockets protocol is used to enable communication between the devices and the smart home hub.",
                "Additional features such as user accounts and the ability to switch between light and dark themes are included."
            ]
        },
        {
            "id":"parking",
            "title": "ParKing",
            "summary": "Parking Android app. The app enables users to easily view nearby parking facilities and relevant information, enabling them to quickly compare the options and find the one that best suits their needs.",
            "get": "<b>Github:</b> <a href=\"https://github.com/BillSmiris/ParKing\">https://github.com/BillSmiris/ParKing</a>",
            "technologies": "Android Studio, Java, Google Firebase",
            "points": [
                "Parking Android application developed for a university project.",
                "Users can view parking facilities in their vicinity either on a map or in a list format.",
                "Users can quickly compare the price, services, and availability of the parking facilities.",
                "The application utilizes Google services and smartphone sensors such as Google Maps, Google Firebase, and GPS."
            ]
        },
        {
            "id":"sandbox",
            "title": "Unity Scripting Demo",
            "summary": "A brief demonstration created to become acquainted with Unity scripting. The demo enables players to control a first-person character and engage with different objects in the surrounding environment.",
            "get": "Demo available <a href=\"https://drive.google.com/file/d/1_4Cv_sLoWSC2ogZUZnQPO2hfmqGqB20G/view?usp=share_link\">here</a>",
            "technologies": "Unity, C#",
            "points": [
                "Small project created to become familiar with scripting in the Unity game engine.",
                "The demo showcases a compact environment featuring a first-person player controller and various interactive elements.",
                "The first-person controller possesses numerous standard functionalities, including movement, camera rotation, sprinting, changing stance (standing, crouching, prone), and interacting with objects within the surroundings.",
                "Interactions are managed by means of a generalized interaction framework that exhibits interaction prompts to the player and enables interaction triggering.",
                "The generalized interaction framework can be extended as required to cater to the needs of each interaction.",
                "Implemented interactions include teleporters, doors, and elevators.",
                "Interaction scripts can receive a number of parameters that influence the interaction's behavior."
            ]
        },
        {
            "id":"edu1821",
            "title": "Educational App",
            "summary": "Educational application created for a university project.Through the application, users can learn about the faces of the Greek War of Independence and evaluate their knowledge via tests. The app is available both in desktop and web versions",
            "get": "<b>Github:</b> <a href=\"https://github.com/BillSmiris/Educational-Application\">https://github.com/BillSmiris/Educational-Application</a>",
            "technologies": "WPF, ASP.NET, C#, HTML5, CSS3, JS, PostgreSQL",
            "points": [
                "Educational application made for a university project.",
                "Through the application, users can learn about the faces of the Greek War of Independence.",
                "Application contains multiple-choice excercises, through which users can evaluate their knowledge.",
                "Application has a desktop and a web version.",
                "Application is designed so its content can easily be expanded upon and be adapted to other topics."
            ]
        },
        {
            "id":"cslab",
            "title": "CSLab Website",
            "summary": "An informational website created for the computer labs of the Department of Informatics at the University of Piraeus. The website serves as a platform where students can obtain information about the lab's operations and access digital services offered by the university.",
            "get": "<b>URL:</b> <a href=\"https://cslab.unipi.gr\">https://cslab.unipi.gr</a>",
            "technologies": "HTML5, CSS3, JS, Bootstrap4, Python, Django",
            "points": [
                "Website created by the Computer Labs Administrator Team of the Department of Informatics at the University of Piraeus.",
                "The website is used as an information point for students of the Department of Informatics, allowing them to stay informed about the digital services provided by the university, the services offered by the department's computer labs, the courses offered by the department, and updates on the operation of the computer labs.",
                "Designed the front-end of the main and wiki pages of the website using Photoshop.",
                "Developed the front-end using HTML, CSS, JS and Bootstrap4.",
                "Performed various update and maintenance tasks after deployment."
            ]
        }
    ],
    "technologiesUsed":"Technologies used",
    "projectPoints":"Project points"
 }